MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA6T1AB3CFP/mcu.h
typedef struct                         /*!< (@ 0x40044200) R_WDT Structure                                            */
{
    union
    {
        __IOM uint8_t WDTRR;           /*!< (@ 0x00000000) WDT Refresh Register                                       */

        struct
        {
            __IOM uint8_t WDTRR : 8;   /*!< [7..0] WDTRR is an 8-bit register that refreshes the down-counter
                                        *   of the WDT.                                                               */
        } WDTRR_b;
    };
    __IM uint8_t RESERVED;

    union
    {
        __IOM uint16_t WDTCR;          /*!< (@ 0x00000002) WDT Control Register                                       */

        struct
        {
            __IOM uint16_t TOPS : 2;   /*!< [1..0] Timeout Period Selection                                           */
            uint16_t            : 2;
            __IOM uint16_t CKS  : 4;   /*!< [7..4] Clock Division Ratio Selection                                     */
            __IOM uint16_t RPES : 2;   /*!< [9..8] Window End Position Selection                                      */
            uint16_t            : 2;
            __IOM uint16_t RPSS : 2;   /*!< [13..12] Window Start Position Selection                                  */
            uint16_t            : 2;
        } WDTCR_b;
    };

    union
    {
        __IOM uint16_t WDTSR;           /*!< (@ 0x00000004) WDT Status Register                                        */

        struct
        {
            __IM uint16_t  CNTVAL : 14; /*!< [13..0] Down-Counter Value                                                */
            __IOM uint16_t UNDFF  : 1;  /*!< [14..14] Underflow Flag                                                   */
            __IOM uint16_t REFEF  : 1;  /*!< [15..15] Refresh Error Flag                                               */
        } WDTSR_b;
    };

    union
    {
        __IOM uint8_t WDTRCR;          /*!< (@ 0x00000006) WDT Reset Control Register                                 */

        struct
        {
            uint8_t               : 7;
            __IOM uint8_t RSTIRQS : 1; /*!< [7..7] Reset Interrupt Request Selection                                  */
        } WDTRCR_b;
    };
    __IM uint8_t RESERVED1;

    union
    {
        __IOM uint8_t WDTCSTPR;        /*!< (@ 0x00000008) WDT Count Stop Control Register                            */

        struct
        {
            uint8_t              : 7;
            __IOM uint8_t SLCSTP : 1;  /*!< [7..7] Sleep-Mode Count Stop Control                                      */
        } WDTCSTPR_b;
    };
    __IM uint8_t  RESERVED2;
    __IM uint16_t RESERVED3;
} R_WDT_Type;                          /*!< Size = 12 (0xc)                                                           */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Asynchronous General Purpose Timer (R_AGTX0)
 */

typedef struct                          /*!< (@ 0x40084000) R_AGTX0 Structure                                          */
{
    union
    {
        __IOM R_AGTX0_AGT32_Type AGT32; /*!< (@ 0x00000000) AGTW (32-bit) peripheral registers                         */
        __IOM R_AGTX0_AGT16_Type AGT16; /*!< (@ 0x00000000) AGT (16-bit) peripheral registers                          */
    };
} R_AGTX0_Type;                         /*!< Size = 20 (0x14)                                                          */

/** @} */ /* End of group Device_Peripheral_peripherals */

/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_peripheralAddr
 * @{
 */

 #define R_ACMPHS0_BASE        0x40085000UL
 #define R_ACMPHS1_BASE        0x40085100UL
 #define R_ACMPHS2_BASE        0x40085200UL
 #define R_ACMPHS3_BASE        0x40085300UL
 #define R_ACMPHS4_BASE        0x40085400UL
 #define R_ACMPHS5_BASE        0x40085500UL
 #define R_ADC0_BASE           0x4005C000UL
 #define R_ADC1_BASE           0x4005C200UL
 #define R_BUS_BASE            0x40003000UL
 #define R_CAC_BASE            0x40044600UL
 #define R_CAN0_BASE           0x40050000UL
 #define R_CAN1_BASE           0x40051000UL
 #define R_CRC_BASE            0x40074000UL
 #define R_DAC_BASE            0x4005E000UL
 #define R_DEBUG_BASE          0x4001B000UL
 #define R_DMA_BASE            0x40005200UL
 #define R_DMAC0_BASE          0x40005000UL
 #define R_DMAC1_BASE          0x40005040UL
 #define R_DMAC2_BASE          0x40005080UL
 #define R_DMAC3_BASE          0x400050C0UL
 #define R_DMAC4_BASE          0x40005100UL
 #define R_DMAC5_BASE          0x40005140UL
 #define R_DMAC6_BASE          0x40005180UL
 #define R_DMAC7_BASE          0x400051C0UL
 #define R_DOC_BASE            0x40054100UL
 #define R_DTC_BASE            0x40005400UL
 #define R_ELC_BASE            0x40041000UL
 #define R_FACI_HP_CMD_BASE    0x407E0000UL
 #define R_FACI_HP_BASE        0x407FE000UL
 #define R_FCACHE_BASE         0x4001C000UL
 #define R_GPT0_BASE           0x40078000UL
 #define R_GPT1_BASE           0x40078100UL
 #define R_GPT2_BASE           0x40078200UL
 #define R_GPT3_BASE           0x40078300UL
 #define R_GPT4_BASE           0x40078400UL
 #define R_GPT5_BASE           0x40078500UL
 #define R_GPT6_BASE           0x40078600UL
 #define R_GPT7_BASE           0x40078700UL
 #define R_GPT8_BASE           0x40078800UL
 #define R_GPT9_BASE           0x40078900UL
 #define R_GPT10_BASE          0x40078A00UL
 #define R_GPT11_BASE          0x40078B00UL
 #define R_GPT12_BASE          0x40078C00UL
 #define R_GPT13_BASE          0x40078D00UL
 #define R_GPT_ODC_BASE        0x4007B000UL
 #define R_GPT_OPS_BASE        0x40078FF0UL
 #define R_GPT_POEG0_BASE      0x40042000UL
 #define R_GPT_POEG1_BASE      0x40042100UL
 #define R_GPT_POEG2_BASE      0x40042200UL
 #define R_GPT_POEG3_BASE      0x40042300UL
 #define R_ICU_BASE            0x40006000UL
 #define R_IIC0_BASE           0x40053000UL
 #define R_IIC1_BASE           0x40053100UL
 #define R_IIC2_BASE           0x40053200UL
 #define R_IRDA_BASE           0x40070F00UL
 #define R_IWDT_BASE           0x40044400UL
 #define R_KINT_BASE           0x40080000UL
 #define R_MMF_BASE            0x40001000UL
 #define R_MPU_MMPU_BASE       0x40000000UL
 #define R_MPU_SMPU_BASE       0x40000C00UL
 #define R_MPU_SPMON_BASE      0x40000D00UL
 #define R_MSTP_BASE           (0x40047000UL - 4UL) /* MSTPCRA is not located in R_MSTP so the base address must be moved so that MSTPCRB is located at 0x40047000. */
 #define R_PORT0_BASE          0x40040000UL
 #define R_PORT1_BASE          0x40040020UL
 #define R_PORT2_BASE          0x40040040UL
 #define R_PORT3_BASE          0x40040060UL
 #define R_PORT4_BASE          0x40040080UL
 #define R_PORT5_BASE          0x400400A0UL
 #define R_PORT6_BASE          0x400400C0UL
 #define R_PORT7_BASE          0x400400E0UL
 #define R_PORT8_BASE          0x40040100UL
 #define R_PORT9_BASE          0x40040120UL
 #define R_PORT10_BASE         0x40040140UL
 #define R_PORT11_BASE         0x40040160UL
 #define R_PORT12_BASE         0x40040180UL
 #define R_PORT13_BASE         0x400401A0UL
 #define R_PORT14_BASE         0x400401C0UL
 #define R_PFS_BASE            0x40040800UL
 #define R_PMISC_BASE          0x40040D00UL
 #define R_RTC_BASE            0x40044000UL
 #define R_SCI0_BASE           0x40070000UL
 #define R_SCI1_BASE           0x40070020UL
 #define R_SCI2_BASE           0x40070040UL
 #define R_SCI3_BASE           0x40070060UL
 #define R_SCI4_BASE           0x40070080UL
 #define R_SCI5_BASE           0x400700A0UL
 #define R_SCI6_BASE           0x400700C0UL
 #define R_SCI7_BASE           0x400700E0UL
 #define R_SCI8_BASE           0x40070100UL
 #define R_SCI9_BASE           0x40070120UL
 #define R_SPI0_BASE           0x40072000UL
 #define R_SPI1_BASE           0x40072100UL
 #define R_SPI2_BASE           0x40072200UL
 #define R_SRAM_BASE           0x40002000UL
 #define R_SRC_BASE            0x40048000UL
 #define R_SYSTEM_BASE         0x4001E000UL
 #define R_TSN_CAL_BASE        0x407FB17CUL
 #define R_TSN_CTRL_BASE       0x4005D000UL
 #define R_WDT_BASE            0x40044200UL
 #define R_AGTX0_BASE          0x40084000UL
 #define R_AGTX1_BASE          0x40084100UL
 #define R_AGTX2_BASE          0x40084200UL
 #define R_AGTX3_BASE          0x40084300UL
 #define R_AGTX4_BASE          0x40084400UL
 #define R_AGTX5_BASE          0x40084500UL
 #define R_AGTX6_BASE          0x40084600UL
 #define R_AGTX7_BASE          0x40084700UL
 #define R_AGTX8_BASE          0x40084800UL
 #define R_AGTX9_BASE          0x40084900UL
 #define R_WDT1_BASE           0x40044300UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */

/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_declaration
 * @{
 */

